Revit 2016 API
CurveLoop Members
The CurveLoop type exposes the following members.
Constructors
Name | Description
CurveLoop
 Constructs a new empty curve loop.
Methods
Name | Description
Append
 Append the curve to this loop.
Create
 Creates a new curve loop.
CreateViaCopy
 Creates a new curve loop as a copy of the input.
CreateViaOffset
 Creates a new curve loop that is an offset of the existing curve loop.
CreateViaThicken(Curve, Double, XYZ)
 Creates a new closed curve loop by thickening the input curve with respect to a given plane.
CreateViaThicken(CurveLoop, Double, XYZ)
 Creates a new closed curve loop by thickening the input open curve loop with respect to a given plane.
CreateViaTransform
 Creates a new curve loop as a transformed copy of the input curve loop.
Dispose
Releases all resources used by the CurveLoop
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Flip
 Reverses the orientation of the curve loop.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetCurveLoopIterator
Returns a curve that iterates through the curve loop.
GetEnumerator
Returns an enumerator that iterates through the curve loop.
GetExactLength
 Returns the sum of exact lengths of all curves in the loop.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPlane
 Gets the plane of the curve loop, if it is planar.
GetRectangularHeight
 Returns the width of a curve loop if it is rectangular with respect to the projection plane.
GetRectangularWidth
 Returns the width of a curve loop if it is rectangular with respect to the projection plane.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
HasPlane
 Identifies if the CurveLoop is planar.
IsCounterclockwise
 Determines if this CurveLoop is oriented counter-clockwise (CCW) or clockwise (CW) with respect to the specified 3D direction.
IsOpen
 Returns whether the curve loop is open or closed, as determined by an internal flag.
IsRectangular
 Identifies if the curve loop is rectangular with respect to a given projection plane.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Transform
 Transforms this curve loop and all of its component curves by the supplied transformation.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
CurveLoop Class
Autodesk.Revit.DB Namespace